htoraby/STM32_Main/src/user/device/em/em_set.cpp
#include "em_set.h"
#include "user_main.h"
#include <string.h>



static void emSetTask(void *p)
{
  (static_cast<EmSet*>(p))->task();
}

EmSet::EmSet()
  : numberRequest_(0)
  , constEm_(1250)
  , constCoefTrans_(1.0)
{

}

EmSet::~EmSet()
{
  closePort();
  osThreadTerminate(threadId_);
}

void EmSet::init()
{
  openPort(9600);

  osThreadDef_t t = {"EmSet", emSetTask, osPriorityNormal, 0, 2 * configMINIMAL_STACK_SIZE};
  threadId_ = osThreadCreate(&t, this);

  readParameters();
}

void EmSet::task()
{
  while (1) {
    osDelay(10);

    sendRequest();
    receiveAnswer();
  }
}

bool EmSet::isConnect()
{
  bool curConnect = true;
  if (failCounter_ > EM_COUNTER_LOST_CONNECT)
    curConnect = false;

  if (prevConnect_ && !curConnect) {
    for (int i = 0; i < countParameters_; ++i) {
      uint16_t id = getFieldId(i);
      if (id != EM_COEFFICIENT_TRANS_CURRENT) {
        float value = NAN;
        setValue(id, value);
      }
    }
  }
  prevConnect_ = curConnect;

  return curConnect;
}

void EmSet::sendRequest()
{
  int sizePktTx = 0;

  switch (numberRequest_)
  {
    // Запрос чтения данных 1
    case 1:
      {
        uint8_t buf[] = {0x84,0x08,0x23,0x01,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных 2
    case 2:
      {
        uint8_t buf[] = {0x84,0x08,0x23,0x02,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных 3
    case 3:
      {
        uint8_t buf[] = {0x84,0x08,0x23,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных константы счётчика
    case 4:
      {
        uint8_t buf[] = {0x84,0x08,0x12,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных энергии
    case 5:
      {
        uint8_t buf[] = {0x84,0x0A,0x00,0x00,0x00,0x05,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения коэффициента трансформации тока
    case 6:
      {
        uint8_t buf[] = {0x84,0x08,0x02,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запись коэффициента трансформации тока
    case 7:
      {
        uint8_t buf[] = {0x84,0x03,0x1C,0x00,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
        int coefTrans = getValue(EM_COEFFICIENT_TRANS_CURRENT);
        txBuffer_[3] = coefTrans >> 8;
        txBuffer_[4] = coefTrans & 0x00FF;
      }
      break;
    // Запрос чтения данных энергии за весь период
    case 8:
      {
        uint8_t buf[] = {0x84,0x0A,0x00,0x00,0x00,0x0F,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных энергии за текущие сутки
    case 9:
      {
        uint8_t buf[] = {0x84,0x0A,0x04,0x00,0x00,0x0F,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных энергии за предыдущие сутки
    case 10:
      {
        uint8_t buf[] = {0x84,0x0A,0x05,0x00,0x00,0x0F,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
    // Запрос чтения данных энергии за текущий месяц
    case 11:
      {
        uint8_t buf[] = {0x84,0x0A,0x03,0x00,0x00,0x0F,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
        time_t time = ksu.getTime();
        tm dateTime = *localtime(&time);
        txBuffer_[3] = dateTime.tm_mon;
      }
      break;
    // Запрос чтения данных энергии за предыдущий месяц
    case 12:
      {
        uint8_t buf[] = {0x84,0x0A,0x03,0x00,0x00,0x0F,0x00,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
        time_t time = ksu.getTime();
        tm dateTime = *localtime(&time);
        txBuffer_[3] = (dateTime.tm_mon == 1) ? 12 : (dateTime.tm_mon - 1);
      }
      break;
    // Запрос открытия канала данных
    default:
      {
        uint8_t buf[] = {0x84,0x01,0x30,0x30,0x30,0x30,0x30,0x30,0x00,0x00};
        sizePktTx = sizeof(buf);
        memcpy(txBuffer_, buf, sizePktTx);
      }
      break;
  }

  uint16_t calcCrc = crc16_ibm(txBuffer_, sizePktTx-2);
  txBuffer_[sizePktTx - 2] = calcCrc & 0x00FF;
  txBuffer_[sizePktTx - 1] = calcCrc >> 8;

  sendUart(txBuffer_, sizePktTx);
  totalCounter_++;
}

void EmSet::receiveAnswer()
{
  memset(rxBuffer_, 0, sizeof(rxBuffer_));
  sizePkt_ = receiveUart(rxBuffer_);
  if (sizePkt_ <= 2) {
    // TODO: Предупреждение: пустой пакет
    lostCounter_++;
    failCounter_++;
    return;
  }

  uint16_t rxCrc = (rxBuffer_[sizePkt_ - 1] << 8) + rxBuffer_[sizePkt_ - 2];
  uint16_t calcCrc = crc16_ibm(rxBuffer_, sizePkt_ - 2);

  if (rxCrc != calcCrc) {
    // TODO: Предупреждение: Ошибка CRC
    crcCounter_++;
    failCounter_++;
    return;
  }

  if (rxBuffer_[1] == 0x05) {
    numberRequest_ = 0;
    return;
  }

  switch (numberRequest_)
  {
    // Ответ на запрос открытия канала данных
    case 0:
      // Проверка на открытие канала
      if (rxBuffer_[1] == 0) {
        numberRequest_++;
      }
      // Канал не открыт - повторяем запрос
      else {
        numberRequest_ = 0;
      }
      break;
    // Ответ на запрос чтения данных 1
    case 1:
      setParameter();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных 2
    case 2:
      setParameter();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных 3
    case 3:
      setParameter();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных константы счётчика
    case 4:
      setConstantEm();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии
    case 5:
      setParamEnergy();
      numberRequest_++;
      break;
    // Ответ на запрос чтения коэффициента трансформации тока
    case 6:
      prepareSendConstantCoefTrans();
      numberRequest_++;
      break;
    // Запись коэффициента трансформации тока
    case 7:
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии за весь период
    case 8:
      setParamEnergyConsumpAll();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии за текущие сутки
    case 9:
      setParamEnergyConsumpCurDay();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии за предыдущие сутки
    case 10:
      setParamEnergyConsumpPrevDay();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии за текущий месяц
    case 11:
      setParamEnergyConsumpCurMonth();
      numberRequest_++;
      break;
    // Ответ на запрос чтения данных энергии за предыдущий месяц
    case 12:
      setParamEnergyConsumpPrevMonth();
      numberRequest_ = 1;
      break;
  }
  successCounter_++;
  failCounter_ = 0;
  asm("nop");
}

void EmSet::setParameter()
{
  unTypeData value;
  value.uint32_t = 0;

  switch(rxBuffer_[1])
  {
    case  1:
      // 16. Резерв
      value.char_t[0] = rxBuffer_[sizePkt_ - 6];
      value.char_t[1] = rxBuffer_[sizePkt_ - 5];
      value.char_t[2] = rxBuffer_[sizePkt_ - 4];
      value.char_t[3] = rxBuffer_[sizePkt_ - 3];
//      setNewValue(EM_, value.tdFloat);

      // 15. Резерв
      value.char_t[0] = rxBuffer_[sizePkt_ - 10];
      value.char_t[1] = rxBuffer_[sizePkt_ - 9];
      value.char_t[2] = rxBuffer_[sizePkt_ - 8];
      value.char_t[3] = rxBuffer_[sizePkt_ - 7];
//      setNewValue(EM_, value.tdFloat);

