htoraby/STM32_Main/src/user/device/em/em_set.cpp
      // 14. Температура внутри счётчика
      value.char_t[0] = rxBuffer_[sizePkt_ - 14];
      value.char_t[1] = rxBuffer_[sizePkt_ - 13];
      value.char_t[2] = rxBuffer_[sizePkt_ - 12];
      value.char_t[3] = rxBuffer_[sizePkt_ - 11];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 13. Частота
      value.char_t[0] = rxBuffer_[sizePkt_ - 18];
      value.char_t[1] = rxBuffer_[sizePkt_ - 17];
      value.char_t[2] = rxBuffer_[sizePkt_ - 16];
      value.char_t[3] = rxBuffer_[sizePkt_ - 15];
      value.float_t = value.float_t;
      setNewValue(EM_FREQUENCY, value.float_t);

      // 12. Активная мощность потерь Фаза 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 22];
      value.char_t[1] = rxBuffer_[sizePkt_ - 21];
      value.char_t[2] = rxBuffer_[sizePkt_ - 20];
      value.char_t[3] = rxBuffer_[sizePkt_ - 19];
//      setNewValue(EM_, value.tdFloat);

      // 11. Активная мощность потерь Фаза 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 26];
      value.char_t[1] = rxBuffer_[sizePkt_ - 25];
      value.char_t[2] = rxBuffer_[sizePkt_ - 24];
      value.char_t[3] = rxBuffer_[sizePkt_ - 23];
//      setNewValue(EM_, value.tdFloat);

      // 10. Активная мощность потерь Фаза 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 30];
      value.char_t[1] = rxBuffer_[sizePkt_ - 29];
      value.char_t[2] = rxBuffer_[sizePkt_ - 28];
      value.char_t[3] = rxBuffer_[sizePkt_ - 27];
//      setNewValue(EM_, value.tdFloat);

      // 9. Активная мошность потерь по трём фазам
      value.char_t[0] = rxBuffer_[sizePkt_ - 34];
      value.char_t[1] = rxBuffer_[sizePkt_ - 33];
      value.char_t[2] = rxBuffer_[sizePkt_ - 32];
      value.char_t[3] = rxBuffer_[sizePkt_ - 31];
//      setNewValue(EM_, value.tdFloat);

      // 8. THD между фазами 3 и 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 38];
      value.char_t[1] = rxBuffer_[sizePkt_ - 37];
      value.char_t[2] = rxBuffer_[sizePkt_ - 36];
      value.char_t[3] = rxBuffer_[sizePkt_ - 35];
//      setNewValue(EM_, value.tdFloat);

      // 7. THD между фазами 2 и 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 42];
      value.char_t[1] = rxBuffer_[sizePkt_ - 41];
      value.char_t[2] = rxBuffer_[sizePkt_ - 40];
      value.char_t[3] = rxBuffer_[sizePkt_ - 39];
//      setNewValue(EM_, value.tdFloat);

      // 6. THD между фазами 1 и 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 46];
      value.char_t[1] = rxBuffer_[sizePkt_ - 45];
      value.char_t[2] = rxBuffer_[sizePkt_ - 44];
      value.char_t[3] = rxBuffer_[sizePkt_ - 43];
//      setNewValue(EM_, value.tdFloat);

      // 5. Коэффициент несимметрии напряжённости
      value.char_t[0] = rxBuffer_[sizePkt_ - 50];
      value.char_t[1] = rxBuffer_[sizePkt_ - 49];
      value.char_t[2] = rxBuffer_[sizePkt_ - 48];
      value.char_t[3] = rxBuffer_[sizePkt_ - 47];
//      setNewValue(EM_, value.tdFloat);

      // 4. THD Напряжения на фазе 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 54];
      value.char_t[1] = rxBuffer_[sizePkt_ - 53];
      value.char_t[2] = rxBuffer_[sizePkt_ - 52];
      value.char_t[3] = rxBuffer_[sizePkt_ - 51];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 3. THD Напряжения на фазе 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 58];
      value.char_t[1] = rxBuffer_[sizePkt_ - 57];
      value.char_t[2] = rxBuffer_[sizePkt_ - 56];
      value.char_t[3] = rxBuffer_[sizePkt_ - 55];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 2. THD Напряжения на фазе 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 62];
      value.char_t[1] = rxBuffer_[sizePkt_ - 61];
      value.char_t[2] = rxBuffer_[sizePkt_ - 60];
      value.char_t[3] = rxBuffer_[sizePkt_ - 59];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 1. Коэффициент несимметрии напряжённости
      value.char_t[0] = rxBuffer_[sizePkt_ - 66];
      value.char_t[1] = rxBuffer_[sizePkt_ - 65];
      value.char_t[2] = rxBuffer_[sizePkt_ - 64];
      value.char_t[3] = rxBuffer_[sizePkt_ - 63];
//      setNewValue(EM_, value.tdFloat);
      break;
    case  2:
      // 16. THD тока по фазе 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 6];
      value.char_t[1] = rxBuffer_[sizePkt_ - 5];
      value.char_t[2] = rxBuffer_[sizePkt_ - 4];
      value.char_t[3] = rxBuffer_[sizePkt_ - 3];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 15. THD тока по фазе 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 10];
      value.char_t[1] = rxBuffer_[sizePkt_ - 9];
      value.char_t[2] = rxBuffer_[sizePkt_ - 8];
      value.char_t[3] = rxBuffer_[sizePkt_ - 7];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 14. THD тока по фазе 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 14];
      value.char_t[1] = rxBuffer_[sizePkt_ - 13];
      value.char_t[2] = rxBuffer_[sizePkt_ - 12];
      value.char_t[3] = rxBuffer_[sizePkt_ - 11];
      value.float_t = value.float_t;
//      setNewValue(EM_, value.tdFloat);

      // 13. Коэффициент несиметрии тока в обратной последовательности
      value.char_t[0] = rxBuffer_[sizePkt_ - 18];
      value.char_t[1] = rxBuffer_[sizePkt_ - 17];
      value.char_t[2] = rxBuffer_[sizePkt_ - 16];
      value.char_t[3] = rxBuffer_[sizePkt_ - 15];
//      setNewValue(EM_, value.tdFloat);

      // 12. Ток фазы 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 22];
      value.char_t[1] = rxBuffer_[sizePkt_ - 21];
      value.char_t[2] = rxBuffer_[sizePkt_ - 20];
      value.char_t[3] = rxBuffer_[sizePkt_ - 19];
      value.float_t = value.float_t;
      setNewValue(EM_CURRENT_PHASE_3, value.float_t);

      // 11. Ток фазы 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 26];
      value.char_t[1] = rxBuffer_[sizePkt_ - 25];
      value.char_t[2] = rxBuffer_[sizePkt_ - 24];
      value.char_t[3] = rxBuffer_[sizePkt_ - 23];
      value.float_t = value.float_t;
      setNewValue(EM_CURRENT_PHASE_2, value.float_t);

