htoraby/STM32_Main/src/user/device/em/em_set.cpp
      // 10. Ток фазы 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 30];
      value.char_t[1] = rxBuffer_[sizePkt_ - 29];
      value.char_t[2] = rxBuffer_[sizePkt_ - 28];
      value.char_t[3] = rxBuffer_[sizePkt_ - 27];
      value.float_t = value.float_t;
      setNewValue(EM_CURRENT_PHASE_1, value.float_t);

      // 9. Коэффициент несиметрии тока в прямой последовательности
      value.char_t[0] = rxBuffer_[sizePkt_ - 34];
      value.char_t[1] = rxBuffer_[sizePkt_ - 33];
      value.char_t[2] = rxBuffer_[sizePkt_ - 32];
      value.char_t[3] = rxBuffer_[sizePkt_ - 31];
//      setNewValue(EM_, value.tdFloat);

      // 8. Межфазное напряжение 3 и 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 38];
      value.char_t[1] = rxBuffer_[sizePkt_ - 37];
      value.char_t[2] = rxBuffer_[sizePkt_ - 36];
      value.char_t[3] = rxBuffer_[sizePkt_ - 35];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_3_1, value.float_t);

      // 7. Межфазное напряжение 2 и 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 42];
      value.char_t[1] = rxBuffer_[sizePkt_ - 41];
      value.char_t[2] = rxBuffer_[sizePkt_ - 40];
      value.char_t[3] = rxBuffer_[sizePkt_ - 39];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_2_3, value.float_t);

      // 6. Межфазное напряжение 1 и 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 46];
      value.char_t[1] = rxBuffer_[sizePkt_ - 45];
      value.char_t[2] = rxBuffer_[sizePkt_ - 44];
      value.char_t[3] = rxBuffer_[sizePkt_ - 43];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_1_2, value.float_t);

      // 5. Напряжение прямой последовательности
      value.char_t[0] = rxBuffer_[sizePkt_ - 50];
      value.char_t[1] = rxBuffer_[sizePkt_ - 49];
      value.char_t[2] = rxBuffer_[sizePkt_ - 48];
      value.char_t[3] = rxBuffer_[sizePkt_ - 47];
//      setNewValue(EM_, value.tdFloat);

      // 4. Напряжение на 3 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 54];
      value.char_t[1] = rxBuffer_[sizePkt_ - 53];
      value.char_t[2] = rxBuffer_[sizePkt_ - 52];
      value.char_t[3] = rxBuffer_[sizePkt_ - 51];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_3, value.float_t);

      // 3. Напряжение на 2 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 58];
      value.char_t[1] = rxBuffer_[sizePkt_ - 57];
      value.char_t[2] = rxBuffer_[sizePkt_ - 56];
      value.char_t[3] = rxBuffer_[sizePkt_ - 55];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_2, value.float_t);

      // 2. Напряжение на 1 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 62];
      value.char_t[1] = rxBuffer_[sizePkt_ - 61];
      value.char_t[2] = rxBuffer_[sizePkt_ - 60];
      value.char_t[3] = rxBuffer_[sizePkt_ - 59];
      value.float_t = value.float_t;
      setNewValue(EM_VOLTAGE_PHASE_1, value.float_t);

      // 1. Батарея питания
      value.char_t[0] = rxBuffer_[sizePkt_ - 66];
      value.char_t[1] = rxBuffer_[sizePkt_ - 65];
      value.char_t[2] = rxBuffer_[sizePkt_ - 64];
      value.char_t[3] = rxBuffer_[sizePkt_ - 63];
//      setNewValue(EM_, value.tdFloat);
      break;
    case  3:
      // 16. Коэффициент мощности по 3 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 6];
      value.char_t[1] = rxBuffer_[sizePkt_ - 5];
      value.char_t[2] = rxBuffer_[sizePkt_ - 4];
      value.char_t[3] = rxBuffer_[sizePkt_ - 3];
      value.float_t = value.float_t;
      setNewValue(EM_COS_PHI_PHASE_3, value.float_t);

      // 15. Коэффициент мощности по 2 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 10];
      value.char_t[1] = rxBuffer_[sizePkt_ - 9];
      value.char_t[2] = rxBuffer_[sizePkt_ - 8];
      value.char_t[3] = rxBuffer_[sizePkt_ - 7];
      value.float_t = value.float_t;
      setNewValue(EM_COS_PHI_PHASE_2, value.float_t);

      // 14. Коэффициент мощности по 1 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 14];
      value.char_t[1] = rxBuffer_[sizePkt_ - 13];
      value.char_t[2] = rxBuffer_[sizePkt_ - 12];
      value.char_t[3] = rxBuffer_[sizePkt_ - 11];
      value.float_t = value.float_t;
      setNewValue(EM_COS_PHI_PHASE_1, value.float_t);

      // 13. Коэффициент мощности по всем фазам
      value.char_t[0] = rxBuffer_[sizePkt_ - 18];
      value.char_t[1] = rxBuffer_[sizePkt_ - 17];
      value.char_t[2] = rxBuffer_[sizePkt_ - 16];
      value.char_t[3] = rxBuffer_[sizePkt_ - 15];
      value.float_t = value.float_t;
      setNewValue(EM_COS_PHI, value.float_t);

      // 12. Полная мсщность по 3 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 22];
      value.char_t[1] = rxBuffer_[sizePkt_ - 21];
      value.char_t[2] = rxBuffer_[sizePkt_ - 20];
      value.char_t[3] = rxBuffer_[sizePkt_ - 19];
      value.float_t = value.float_t;
      setNewValue(EM_FULL_POWER_PHASE_3, value.float_t);

      // 11. Полная мощность по 2 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 26];
      value.char_t[1] = rxBuffer_[sizePkt_ - 25];
      value.char_t[2] = rxBuffer_[sizePkt_ - 24];
      value.char_t[3] = rxBuffer_[sizePkt_ - 23];
      value.float_t = value.float_t;
      setNewValue(EM_FULL_POWER_PHASE_2, value.float_t);

      // 10. Полная мощность по 1 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 30];
      value.char_t[1] = rxBuffer_[sizePkt_ - 29];
      value.char_t[2] = rxBuffer_[sizePkt_ - 28];
      value.char_t[3] = rxBuffer_[sizePkt_ - 27];
      value.float_t = value.float_t;
      setNewValue(EM_FULL_POWER_PHASE_1, value.float_t);

      // 9. Полная мощность по 3-м фазам
      value.char_t[0] = rxBuffer_[sizePkt_ - 34];
      value.char_t[1] = rxBuffer_[sizePkt_ - 33];
      value.char_t[2] = rxBuffer_[sizePkt_ - 32];
      value.char_t[3] = rxBuffer_[sizePkt_ - 31];
      value.float_t = value.float_t;
      setNewValue(EM_FULL_POWER, value.float_t);

      // 8. Реактивная мощность по 3 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 38];
      value.char_t[1] = rxBuffer_[sizePkt_ - 37];
      value.char_t[2] = rxBuffer_[sizePkt_ - 36];
      value.char_t[3] = rxBuffer_[sizePkt_ - 35];
      value.float_t = value.float_t;
      setNewValue(EM_REACTIVE_POWER_PHASE_3, value.float_t);

      // 7. Реактивная мощность по 2 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 42];
      value.char_t[1] = rxBuffer_[sizePkt_ - 41];
      value.char_t[2] = rxBuffer_[sizePkt_ - 40];
      value.char_t[3] = rxBuffer_[sizePkt_ - 39];
      value.float_t = value.float_t;
      setNewValue(EM_REACTIVE_POWER_PHASE_2, value.float_t);

      // 6.  Реактивная мощность по 1 фазе
      value.char_t[0] = rxBuffer_[sizePkt_ - 46];
      value.char_t[1] = rxBuffer_[sizePkt_ - 45];
      value.char_t[2] = rxBuffer_[sizePkt_ - 44];
      value.char_t[3] = rxBuffer_[sizePkt_ - 43];
      value.float_t = value.float_t;
      setNewValue(EM_REACTIVE_POWER_PHASE_1, value.float_t);

      // 5. Реактивная мощность по 3-м фазам
      value.char_t[0] = rxBuffer_[sizePkt_ - 50];
      value.char_t[1] = rxBuffer_[sizePkt_ - 49];
      value.char_t[2] = rxBuffer_[sizePkt_ - 48];
      value.char_t[3] = rxBuffer_[sizePkt_ - 47];
      value.float_t = value.float_t;
      setNewValue(EM_REACTIVE_POWER, value.float_t);

