htoraby/STM32_Main/src/user/device/em/em_set.cpp
      // 4. Активная мсщность на фазе 3
      value.char_t[0] = rxBuffer_[sizePkt_ - 54];
      value.char_t[1] = rxBuffer_[sizePkt_ - 53];
      value.char_t[2] = rxBuffer_[sizePkt_ - 52];
      value.char_t[3] = rxBuffer_[sizePkt_ - 51];
      value.float_t = value.float_t;
      setNewValue(EM_ACTIVE_POWER_PHASE_3, value.float_t);

      // 3. Активная мсщность на фазе 2
      value.char_t[0] = rxBuffer_[sizePkt_ - 58];
      value.char_t[1] = rxBuffer_[sizePkt_ - 57];
      value.char_t[2] = rxBuffer_[sizePkt_ - 56];
      value.char_t[3] = rxBuffer_[sizePkt_ - 55];
      value.float_t = value.float_t;
      setNewValue(EM_ACTIVE_POWER_PHASE_2, value.float_t);

      // 2. Активная мсщность на фазе 1
      value.char_t[0] = rxBuffer_[sizePkt_ - 62];
      value.char_t[1] = rxBuffer_[sizePkt_ - 61];
      value.char_t[2] = rxBuffer_[sizePkt_ - 60];
      value.char_t[3] = rxBuffer_[sizePkt_ - 59];
      value.float_t = value.float_t;
      setNewValue(EM_ACTIVE_POWER_PHASE_1, value.float_t);

      // 1. Суммарная активная мощность по 3 фазам
      value.char_t[0] = rxBuffer_[sizePkt_ - 66];
      value.char_t[1] = rxBuffer_[sizePkt_ - 65];
      value.char_t[2] = rxBuffer_[sizePkt_ - 64];
      value.char_t[3] = rxBuffer_[sizePkt_ - 63];
      value.float_t = value.float_t;
      setNewValue(EM_ACTIVE_POWER, value.float_t);
      break;
  }
}

void EmSet::setParamEnergy()
{
  unTypeData value;
  value.uint32_t = 0;

  // 2. R
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t/(2*constEm_);
  setNewValue(EM_REACTIVE_ENERGY, value.float_t);

  // 1. A
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t/(2*constEm_);
  setNewValue(EM_ACTIVE_ENERGY, value.float_t);
}

void EmSet::setParamEnergyConsumpAll()
{
  unTypeData value;
  value.uint32_t = 0;

  // 1. R-
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_MINUS_ALL, value.float_t);

  // 1. R+
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_PLUS_ALL, value.float_t);

  // 2. A-
  value.char_t[0] = rxBuffer_[sizePkt_ - 11];
  value.char_t[1] = rxBuffer_[sizePkt_ - 12];
  value.char_t[2] = rxBuffer_[sizePkt_ - 13];
  value.char_t[3] = rxBuffer_[sizePkt_ - 14];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_MINUS_ALL, value.float_t);

  // 2. A+
  value.char_t[0] = rxBuffer_[sizePkt_ - 15];
  value.char_t[1] = rxBuffer_[sizePkt_ - 16];
  value.char_t[2] = rxBuffer_[sizePkt_ - 17];
  value.char_t[3] = rxBuffer_[sizePkt_ - 18];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_PLUS_ALL, value.float_t);
}

void EmSet::setParamEnergyConsumpCurDay()
{
  unTypeData value;
  value.uint32_t = 0;

  // 1. R-
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_MINUS_CUR_DAY, value.float_t);

  // 1. R+
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_PLUS_CUR_DAY, value.float_t);

  // 2. A-
  value.char_t[0] = rxBuffer_[sizePkt_ - 11];
  value.char_t[1] = rxBuffer_[sizePkt_ - 12];
  value.char_t[2] = rxBuffer_[sizePkt_ - 13];
  value.char_t[3] = rxBuffer_[sizePkt_ - 14];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_MINUS_CUR_DAY, value.float_t);

  // 2. A+
  value.char_t[0] = rxBuffer_[sizePkt_ - 15];
  value.char_t[1] = rxBuffer_[sizePkt_ - 16];
  value.char_t[2] = rxBuffer_[sizePkt_ - 17];
  value.char_t[3] = rxBuffer_[sizePkt_ - 18];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_PLUS_CUR_DAY, value.float_t);
}

void EmSet::setParamEnergyConsumpPrevDay()
{
  unTypeData value;
  value.uint32_t = 0;

  // 1. R-
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_MINUS_PREV_DAY, value.float_t);

  // 1. R+
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_PLUS_PREV_DAY, value.float_t);

  // 2. A-
  value.char_t[0] = rxBuffer_[sizePkt_ - 11];
  value.char_t[1] = rxBuffer_[sizePkt_ - 12];
  value.char_t[2] = rxBuffer_[sizePkt_ - 13];
  value.char_t[3] = rxBuffer_[sizePkt_ - 14];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_MINUS_PREV_DAY, value.float_t);

  // 2. A+
  value.char_t[0] = rxBuffer_[sizePkt_ - 15];
  value.char_t[1] = rxBuffer_[sizePkt_ - 16];
  value.char_t[2] = rxBuffer_[sizePkt_ - 17];
  value.char_t[3] = rxBuffer_[sizePkt_ - 18];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_PLUS_PREV_DAY, value.float_t);
}

void EmSet::setParamEnergyConsumpCurMonth()
{
  unTypeData value;
  value.uint32_t = 0;

