htoraby/STM32_Main/src/user/device/em/em_set.cpp
  // 1. R-
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_MINUS_CUR_MONTH, value.float_t);

  // 1. R+
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_PLUS_CUR_MONTH, value.float_t);

  // 2. A-
  value.char_t[0] = rxBuffer_[sizePkt_ - 11];
  value.char_t[1] = rxBuffer_[sizePkt_ - 12];
  value.char_t[2] = rxBuffer_[sizePkt_ - 13];
  value.char_t[3] = rxBuffer_[sizePkt_ - 14];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_MINUS_CUR_MONTH, value.float_t);

  // 2. A+
  value.char_t[0] = rxBuffer_[sizePkt_ - 15];
  value.char_t[1] = rxBuffer_[sizePkt_ - 16];
  value.char_t[2] = rxBuffer_[sizePkt_ - 17];
  value.char_t[3] = rxBuffer_[sizePkt_ - 18];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_PLUS_CUR_MONTH, value.float_t);
}

void EmSet::setParamEnergyConsumpPrevMonth()
{
  unTypeData value;
  value.uint32_t = 0;

  // 1. R-
  value.char_t[0] = rxBuffer_[sizePkt_ - 3];
  value.char_t[1] = rxBuffer_[sizePkt_ - 4];
  value.char_t[2] = rxBuffer_[sizePkt_ - 5];
  value.char_t[3] = rxBuffer_[sizePkt_ - 6];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_MINUS_PREV_MONTH, value.float_t);

  // 1. R+
  value.char_t[0] = rxBuffer_[sizePkt_ - 7];
  value.char_t[1] = rxBuffer_[sizePkt_ - 8];
  value.char_t[2] = rxBuffer_[sizePkt_ - 9];
  value.char_t[3] = rxBuffer_[sizePkt_ - 10];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_REACTIVE_PLUS_PREV_MONTH, value.float_t);

  // 2. A-
  value.char_t[0] = rxBuffer_[sizePkt_ - 11];
  value.char_t[1] = rxBuffer_[sizePkt_ - 12];
  value.char_t[2] = rxBuffer_[sizePkt_ - 13];
  value.char_t[3] = rxBuffer_[sizePkt_ - 14];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_MINUS_PREV_MONTH, value.float_t);

  // 2. A+
  value.char_t[0] = rxBuffer_[sizePkt_ - 15];
  value.char_t[1] = rxBuffer_[sizePkt_ - 16];
  value.char_t[2] = rxBuffer_[sizePkt_ - 17];
  value.char_t[3] = rxBuffer_[sizePkt_ - 18];
  value.float_t = (float)value.uint32_t*constCoefTrans_/(2*constEm_);
  setNewValue(EM_ACTIVE_PLUS_PREV_MONTH, value.float_t);
}

void EmSet::setConstantEm()
{
  switch(rxBuffer_[sizePkt_ - 4] & 0x0F) {
    case 0:
      constEm_ = 5000;
      break;
    case 1:
      constEm_ = 25000;
      break;
    case 2:
      constEm_ = 1250;
      break;
    case 3:
      constEm_ = 6250;
      break;
    case 4:
      constEm_ = 500;
      break;
    case 5:
      constEm_ = 250;
      break;
    case 6:
      constEm_ = 6400;
      break;
  }
}

int EmSet::prepareSendConstantCoefTrans()
{
  constCoefTrans_ = rxBuffer_[sizePkt_ - 12] * 256 + rxBuffer_[sizePkt_ - 11];
  int coefTrans = getValue(EM_COEFFICIENT_TRANS_CURRENT);

  if((rxBuffer_[sizePkt_ - 9] == (coefTrans & 0x00FF))
     && (rxBuffer_[sizePkt_ - 10] == (coefTrans >> 8)))
    return 8;
  else
    return 7;
}
